src/AccumulationRegisters/Расходы/Расходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияРасходов</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Доходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорииДоходов</name>
    <type>
      <types>CatalogRef.КатегорииДоходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/CommonModules/ОбщийМодульСервер_Отчеты/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль сервер: аналитические отчёты.
// Данные по категориям/дням и HTML-представление для мобильных форм.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает таблицу оборотов по категориям за период.
// Колонки: Категория, Сумма, Процент.
// Суммы — в валюте учёта (ресурс Сумма регистров).
//
Функция ОборотыПоКатегориям(ВидОперацииРасход, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ВидОперацииРасход Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Обороты.КатегорияРасходов КАК Категория,
		|	СУММА(Обороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Расходы.Обороты(&НачалоПериода, &КонецПериода) КАК Обороты
		|ГДЕ
		|	Обороты.СуммаОборот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.КатегорияРасходов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Обороты.КатегорииДоходов КАК Категория,
		|	СУММА(Обороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Доходы.Обороты(&НачалоПериода, &КонецПериода) КАК Обороты
		|ГДЕ
		|	Обороты.СуммаОборот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.КатегорииДоходов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("Процент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 1)));
	
	Итого = 0;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Итого = Итого + СтрокаТаблицы.Сумма;
		
	КонецЦикла;
	
	Если Итого <> 0 Тогда
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			
			СтрокаТаблицы.Процент = Окр(100 * СтрокаТаблицы.Сумма / Итого, 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СвернутьМелкиеКатегории(Таблица, Итого);
	
	Возврат Таблица;
	
КонецФункции

// Возвращает таблицу оборотов выбранной категории по дням.
// Колонки: День, Сумма, Процент.
//
Функция ОборотыКатегорииПоДням(ВидОперацииРасход, Категория, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ВидОперацииРасход Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ) КАК День,
		|	СУММА(Обороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Расходы.Обороты(&НачалоПериода, &КонецПериода, День, КатегорияРасходов = &Категория) КАК Обороты
		|ГДЕ
		|	Обороты.СуммаОборот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	День УБЫВ";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ) КАК День,
		|	СУММА(Обороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Доходы.Обороты(&НачалоПериода, &КонецПериода, День, КатегорииДоходов = &Категория) КАК Обороты
		|ГДЕ
		|	Обороты.СуммаОборот <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	День УБЫВ";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Категория", Категория);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("Процент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 1)));
	
	Итого = 0;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Итого = Итого + СтрокаТаблицы.Сумма;
		
	КонецЦикла;
	
	Если Итого <> 0 Тогда
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			
			СтрокаТаблицы.Процент = Окр(100 * СтрокаТаблицы.Сумма / Итого, 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Формирует HTML сводного отчёта: доходы и расходы за период.
//
Функция HTMLСводногоОтчетаПоОперациям(НачалоПериода, КонецПериода, ВидПериода) Экспорт
	
	ТаблицаДоходов = ОборотыПоКатегориям(Ложь, НачалоПериода, КонецПериода);
	ТаблицаРасходов = ОборотыПоКатегориям(Истина, НачалоПериода, КонецПериода);
	
	ИтогоДоходов = СуммаТаблицы(ТаблицаДоходов);
	ИтогоРасходов = СуммаТаблицы(ТаблицаРасходов);
	Разница = ИтогоДоходов - ИтогоРасходов;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Строки = Новый Массив;
	ДобавитьОбщиеСтилиОтчета(Строки, "#1c2430");
	Строки.Добавить("<body>");
	Строки.Добавить("<a class=""back"" href=""app:back"">← Назад</a>");
	Строки.Добавить("<div class=""header"">");
	Строки.Добавить("<div class=""title"">Операции</div>");
	Строки.Добавить("<div class=""sub"">" + ЭкранироватьHTML(ПредставлениеПериодаОтчета(НачалоПериода, КонецПериода, ВалютаУчета)) + "</div>");
	Строки.Добавить("</div>");
	Строки.Добавить(HTMLПереключателиПериода(ВидПериода));
	
	Строки.Добавить("<div class=""summary-card"">");
	Строки.Добавить("<div class=""sum-line pos""><span>Доходы</span><span>"
		+ ЭкранироватьHTML(ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(ИтогоДоходов, Истина)) + "</span></div>");
	Строки.Добавить("<div class=""sum-line neg""><span>Расходы</span><span>"
		+ ЭкранироватьHTML(ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(-ИтогоРасходов, Истина)) + "</span></div>");
	Строки.Добавить("<div class=""sum-line total-line""><span>Итого</span><span>"
		+ ЭкранироватьHTML(ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(Разница, Истина)) + "</span></div>");
	Строки.Добавить("</div>");
	
	Если ТаблицаДоходов.Количество() = 0 И ТаблицаРасходов.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">Операций за выбранный период нет</div>");
		
	Иначе
		
		ДобавитьБлокКатегорийВHTML(Строки, "Доходы", ТаблицаДоходов, Ложь, "#2e7d32");
		ДобавитьБлокКатегорийВHTML(Строки, "Расходы", ТаблицаРасходов, Истина, "#e53935");
		
	КонецЕсли;
	
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// Формирует HTML отчёта по категориям (доходы или расходы).
//
Функция HTMLОтчетаПоКатегориям(ВидОперацииРасход, НачалоПериода, КонецПериода, ВидПериода) Экспорт
	
	Таблица = ОборотыПоКатегориям(ВидОперацииРасход, НачалоПериода, КонецПериода);
	Итого = 0;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Итого = Итого + СтрокаТаблицы.Сумма;
		
	КонецЦикла;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Акцент = ?(ВидОперацииРасход, "#e53935", "#2e7d32");
	Заголовок = ?(ВидОперацииРасход, "Расходы", "Доходы");
	ПодписьИтого = ?(ВидОперацииРасход, "потрачено за период", "получено за период");
	ПустойТекст = ?(ВидОперацииРасход, "Расходов за выбранный период нет", "Доходов за выбранный период нет");
	ЗаголовокСписка = ?(ВидОперацииРасход, "Категории", "Источники дохода");
	
	Строки = Новый Массив;
	ДобавитьОбщиеСтилиОтчета(Строки, Акцент);
	Строки.Добавить("<body>");
	Строки.Добавить("<div class=""header"">");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(Заголовок) + "</div>");
	Строки.Добавить("<div class=""sub"">" + ЭкранироватьHTML(ПредставлениеПериодаОтчета(НачалоПериода, КонецПериода, ВалютаУчета)) + "</div>");
	Строки.Добавить("</div>");
	Строки.Добавить("<div class=""total"">" + ЭкранироватьHTML(ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(Итого, Ложь)) + "</div>");
	Строки.Добавить("<div class=""total-sub"">" + ЭкранироватьHTML(ПодписьИтого) + "</div>");
	Строки.Добавить(HTMLПереключателиПериода(ВидПериода));
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">" + ЭкранироватьHTML(ПустойТекст) + "</div>");
		
	Иначе
		
		Строки.Добавить("<div class=""section"">" + ЭкранироватьHTML(ЗаголовокСписка) + "</div>");
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			
			ИмяКатегории = ?(ЗначениеЗаполнено(СтрокаТаблицы.Категория), Строка(СтрокаТаблицы.Категория), "Прочее");
			Ширина = Формат(Макс(СтрокаТаблицы.Процент, 0), "ЧДЦ=1; ЧРД=.; ЧН=0; ЧГ=");
			СуммаТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(СтрокаТаблицы.Сумма, Ложь);
			ПроцентТекст = Формат(СтрокаТаблицы.Процент, "ЧДЦ=0; ЧН=0; ЧГ=") + "%";
			СтрокаВерха = "<div class=""item-top""><span class=""name"">" + ЭкранироватьHTML(ИмяКатегории)
				+ "</span><span class=""meta"">" + ЭкранироватьHTML(СуммаТекст) + " · " + ЭкранироватьHTML(ПроцентТекст) + "</span></div>";
			СтрокаИндикатора = "<div class=""bar""><div class=""bar-fill"" style=""width:" + Ширина + "%""></div></div>";
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Категория) Тогда
				
				Ссылка = "app:category:" + Строка(СтрокаТаблицы.Категория.УникальныйИдентификатор());
				Строки.Добавить("<a class=""item"" href=""" + Ссылка + """>");
				Строки.Добавить(СтрокаВерха);
				Строки.Добавить(СтрокаИндикатора);
				Строки.Добавить("</a>");
				
			Иначе
				
				Строки.Добавить("<div class=""item static"">");
				Строки.Добавить(СтрокаВерха);
				Строки.Добавить(СтрокаИндикатора);
				Строки.Добавить("</div>");
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// Формирует HTML расшифровки категории по дням.
//
Функция HTMLРасшифровкиПоДням(ВидОперацииРасход, Категория, НачалоПериода, КонецПериода, ВидПериода) Экспорт
	
	Таблица = ОборотыКатегорииПоДням(ВидОперацииРасход, Категория, НачалоПериода, КонецПериода);
	Итого = 0;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Итого = Итого + СтрокаТаблицы.Сумма;
		
	КонецЦикла;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Акцент = ?(ВидОперацииРасход, "#e53935", "#2e7d32");
	ИмяКатегории = ?(ЗначениеЗаполнено(Категория), Строка(Категория), "Прочее");
	ПодписьИтого = ?(ВидОперацииРасход, "потрачено в категории", "получено в категории");
	
	Строки = Новый Массив;
	ДобавитьОбщиеСтилиОтчета(Строки, Акцент);
	Строки.Добавить("<body>");
	Строки.Добавить("<a class=""back"" href=""app:back"">← Назад</a>");
	Строки.Добавить("<div class=""header"">");
	Строки.Добавить("<div class=""title"">" + ЭкранироватьHTML(ИмяКатегории) + "</div>");
	Строки.Добавить("<div class=""sub"">" + ЭкранироватьHTML(ПредставлениеПериодаОтчета(НачалоПериода, КонецПериода, ВалютаУчета)) + "</div>");
	Строки.Добавить("</div>");
	Строки.Добавить("<div class=""total"">" + ЭкранироватьHTML(ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(Итого, Ложь)) + "</div>");
	Строки.Добавить("<div class=""total-sub"">" + ЭкранироватьHTML(ПодписьИтого) + "</div>");
	Строки.Добавить(HTMLПереключателиПериода(ВидПериода));
	
	Если Таблица.Количество() = 0 Тогда
		
		Строки.Добавить("<div class=""empty"">По категории нет данных за выбранный период</div>");
		
	Иначе
		
		Строки.Добавить("<div class=""section"">По дням</div>");
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			
			Ширина = Формат(Макс(СтрокаТаблицы.Процент, 0), "ЧДЦ=1; ЧРД=.; ЧН=0; ЧГ=");
			СуммаТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(СтрокаТаблицы.Сумма, Ложь);
			ДатаТекст = Формат(СтрокаТаблицы.День, "ДЛФ=D");
			
			Строки.Добавить("<div class=""item static"">");
			Строки.Добавить("<div class=""item-top""><span class=""name"">" + ЭкранироватьHTML(ДатаТекст)
				+ "</span><span class=""meta"">" + ЭкранироватьHTML(СуммаТекст) + "</span></div>");
			Строки.Добавить("<div class=""bar""><div class=""bar-fill"" style=""width:" + Ширина + "%""></div></div>");
			Строки.Добавить("</div>");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

// Устанавливает границы периода по виду: Сегодня / Неделя / Месяц.
//
Процедура УстановитьПериодПоВиду(ВидПериода, НачалоПериода, КонецПериода) Экспорт
	
	ТекущаяДатаСеанса = ТекущаяДата();
	
	Если ВидПериода = "Сегодня" Тогда
		
		НачалоПериода = НачалоДня(ТекущаяДатаСеанса);
		КонецПериода = КонецДня(ТекущаяДатаСеанса);
		
	ИначеЕсли ВидПериода = "Неделя" Тогда
		
		НачалоПериода = НачалоНедели(ТекущаяДатаСеанса);
		КонецПериода = КонецНедели(ТекущаяДатаСеанса);
		
	Иначе
		
		ВидПериода = "Месяц";
		НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса);
		КонецПериода = КонецМесяца(ТекущаяДатаСеанса);
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет вид периода по переданным датам.
//
Функция ОпределитьВидПериода(НачалоПериода, КонецПериода) Экспорт
	
	ТекущаяДатаСеанса = ТекущаяДата();
	
	Если НачалоПериода = НачалоДня(ТекущаяДатаСеанса) И КонецПериода = КонецДня(ТекущаяДатаСеанса) Тогда
		
		Возврат "Сегодня";
		
	ИначеЕсли НачалоПериода = НачалоНедели(ТекущаяДатаСеанса) И КонецПериода = КонецНедели(ТекущаяДатаСеанса) Тогда
		
		Возврат "Неделя";
		
	ИначеЕсли НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса) И КонецПериода = КонецМесяца(ТекущаяДатаСеанса) Тогда
		
		Возврат "Месяц";
		
	КонецЕсли;
	
	Возврат "Период";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СуммаТаблицы(Таблица)
	
	Итого = 0;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Итого = Итого + СтрокаТаблицы.Сумма;
		
	КонецЦикла;
	
	Возврат Итого;
	
КонецФункции

Процедура ДобавитьБлокКатегорийВHTML(Строки, ЗаголовокБлока, Таблица, ВидОперацииРасход, Акцент)
	
	Если Таблица.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Строки.Добавить("<div class=""section"" style=""margin-top:16px"">" + ЭкранироватьHTML(ЗаголовокБлока) + "</div>");
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		ИмяКатегории = ?(ЗначениеЗаполнено(СтрокаТаблицы.Категория), Строка(СтрокаТаблицы.Категория), "Прочее");
		Ширина = Формат(Макс(СтрокаТаблицы.Процент, 0), "ЧДЦ=1; ЧРД=.; ЧН=0; ЧГ=");
		СуммаТекст = ОбщийМодульСервер_КурсыВалют.ПредставлениеСуммыВВалютеУчета(СтрокаТаблицы.Сумма, Ложь);
		ПроцентТекст = Формат(СтрокаТаблицы.Процент, "ЧДЦ=0; ЧН=0; ЧГ=") + "%";
		СтрокаВерха = "<div class=""item-top""><span class=""name"">" + ЭкранироватьHTML(ИмяКатегории)
			+ "</span><span class=""meta"">" + ЭкранироватьHTML(СуммаТекст) + " · " + ЭкранироватьHTML(ПроцентТекст) + "</span></div>";
		СтрокаИндикатора = "<div class=""bar""><div class=""bar-fill"" style=""width:" + Ширина + "%;background:" + Акцент + """></div></div>";
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Категория) Тогда
			
			ВидСсылки = ?(ВидОперацииРасход, "rashod", "dohod");
			Ссылка = "app:category:" + ВидСсылки + ":" + Строка(СтрокаТаблицы.Категория.УникальныйИдентификатор());
			Строки.Добавить("<a class=""item"" href=""" + Ссылка + """>");
			Строки.Добавить(СтрокаВерха);
			Строки.Добавить(СтрокаИндикатора);
			Строки.Добавить("</a>");
			
		Иначе
			
			Строки.Добавить("<div class=""item static"">");
			Строки.Добавить(СтрокаВерха);
			Строки.Добавить(СтрокаИндикатора);
			Строки.Добавить("</div>");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СвернутьМелкиеКатегории(Таблица, Итого)
	
	МаксимумСтрок = 8;
	
	Если Таблица.Количество() <= МаксимумСтрок Или Итого = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СуммаПрочего = 0;
	Индекс = Таблица.Количество() - 1;
	
	Пока Индекс >= МаксимумСтрок - 1 Цикл
		
		СуммаПрочего = СуммаПрочего + Таблица[Индекс].Сумма;
		Таблица.Удалить(Индекс);
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	Если СуммаПрочего = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаПрочего = Таблица.Добавить();
	СтрокаПрочего.Категория = Неопределено;
	СтрокаПрочего.Сумма = СуммаПрочего;
	СтрокаПрочего.Процент = Окр(100 * СуммаПрочего / Итого, 1);
	
КонецПроцедуры

Процедура ДобавитьОбщиеСтилиОтчета(Строки, Акцент)
	
	Строки.Добавить("<!DOCTYPE html><html lang=""ru""><head><meta charset=""utf-8"">");
	Строки.Добавить("<meta name=""viewport"" content=""width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"">");
	Строки.Добавить("<style>");
	Строки.Добавить("*{box-sizing:border-box;margin:0;padding:0;-webkit-tap-highlight-color:transparent}");
	Строки.Добавить("body{font-family:-apple-system,BlinkMacSystemFont,""Segoe UI"",Roboto,Arial,sans-serif;background:#fff;color:#1c2430;padding:16px;line-height:1.35}");
	Строки.Добавить("a{text-decoration:none;color:inherit;display:block}");
	Строки.Добавить(".header{margin-bottom:10px}");
	Строки.Добавить(".title{font-size:28px;font-weight:700;letter-spacing:-0.03em}");
	Строки.Добавить(".sub{margin-top:4px;font-size:14px;color:#8b95a5}");
	Строки.Добавить(".total{margin-top:8px;font-size:34px;font-weight:700;color:" + Акцент + "}");
	Строки.Добавить(".total-sub{margin-top:2px;margin-bottom:14px;font-size:14px;color:#8b95a5}");
	Строки.Добавить(".periods{display:flex;gap:8px;margin-bottom:18px;flex-wrap:wrap}");
	Строки.Добавить(".periods a{padding:8px 12px;border-radius:999px;background:#f3f5f7;font-size:13px;font-weight:600;color:#5b6573}");
	Строки.Добавить(".periods a.active{background:" + Акцент + ";color:#fff}");
	Строки.Добавить(".section{font-size:13px;font-weight:700;color:#8b95a5;text-transform:uppercase;letter-spacing:0.04em;margin-bottom:8px}");
	Строки.Добавить(".item{padding:12px 0;border-top:1px solid #eef1f4}");
	Строки.Добавить(".item:first-of-type{border-top:none}");
	Строки.Добавить(".item-top{display:flex;justify-content:space-between;gap:10px;margin-bottom:8px}");
	Строки.Добавить(".name{font-size:15px;font-weight:600;color:#1c2430}");
	Строки.Добавить(".meta{font-size:14px;color:#5b6573;white-space:nowrap}");
	Строки.Добавить(".bar{height:8px;background:#eef1f4;border-radius:999px;overflow:hidden}");
	Строки.Добавить(".bar-fill{height:100%;background:" + Акцент + ";border-radius:999px}");
	Строки.Добавить(".empty{padding:24px 0;font-size:15px;color:#8b95a5}");
	Строки.Добавить(".back{display:inline-block;margin-bottom:12px;font-size:15px;font-weight:600;color:#5b6573}");
	Строки.Добавить(".summary-card{background:#f7f8fa;border-radius:16px;padding:14px 16px;margin-bottom:8px}");
	Строки.Добавить(".sum-line{display:flex;justify-content:space-between;gap:10px;padding:8px 0;font-size:15px;font-weight:600}");
	Строки.Добавить(".sum-line.pos{color:#2e7d32}");
	Строки.Добавить(".sum-line.neg{color:#e53935}");
	Строки.Добавить(".sum-line.total-line{border-top:1px solid #e1e5ea;margin-top:4px;padding-top:12px;color:#1c2430}");
	Строки.Добавить("</style></head>");
	
КонецПроцедуры

Функция HTMLПереключателиПериода(ВидПериода)
	
	Части = Новый Массив;
	Части.Добавить("<div class=""periods"">");
	Части.Добавить(HTMLКнопкаПериода("Сегодня", ВидПериода));
	Части.Добавить(HTMLКнопкаПериода("Неделя", ВидПериода));
	Части.Добавить(HTMLКнопкаПериода("Месяц", ВидПериода));
	Части.Добавить("</div>");
	
	Возврат СтрСоединить(Части, "");
	
КонецФункции

Функция HTMLКнопкаПериода(ИмяПериода, ТекущийВид)
	
	Класс = ?(ИмяПериода = ТекущийВид, "active", "");
	
	Возврат "<a class=""" + Класс + """ href=""app:period:" + ИмяПериода + """>" + ИмяПериода + "</a>";
	
КонецФункции

Функция ПредставлениеПериодаОтчета(НачалоПериода, КонецПериода, ВалютаУчета)
	
	Если НачалоДня(НачалоПериода) = НачалоМесяца(НачалоПериода)
		И КонецДня(КонецПериода) = КонецМесяца(НачалоПериода) Тогда
		
		ПериодТекст = Формат(НачалоПериода, "ДФ='ММММ гггг'");
		
	ИначеЕсли НачалоДня(НачалоПериода) = НачалоДня(КонецПериода) Тогда
		
		ПериодТекст = Формат(НачалоПериода, "ДЛФ=D");
		
	Иначе
		
		ПериодТекст = Формат(НачалоПериода, "ДЛФ=D") + " – " + Формат(КонецПериода, "ДЛФ=D");
		
	КонецЕсли;
	
	КодВалюты = "";
	
	Если ЗначениеЗаполнено(ВалютаУчета) Тогда
		
		КодВалюты = Строка(ВалютаУчета.Код);
		
		Если Не ЗначениеЗаполнено(КодВалюты) Тогда
			
			КодВалюты = Строка(ВалютаУчета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодВалюты) Тогда
		
		Возврат ПериодТекст + " · " + КодВалюты;
		
	КонецЕсли;
	
	Возврат ПериодТекст;
	
КонецФункции

Функция ЭкранироватьHTML(Знач Текст)
	
	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
